gcc -g p2original.c
 ./a.out
Enter the three numbers
3
6
8
8 is the largest number
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x820: file p2original.c, line 40.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:40
40    printf("Enter the three numbers\n");
(gdb) n
Enter the three numbers
41    a = input();
(gdb) n
4
42    b = input();
(gdb) n
6
43    c = input();
(gdb) n
7
44    largest = cmp(a,b,c);
(gdb) p a
$1 = 4
(gdb) p b
$2 = 6
(gdb) p c
$3 = 7
(gdb) n
45    output(a,b,c,largest);
(gdb) p largest
$4 = 7
(gdb) n
7 is the largest number
46    return 0;
(gdb) n
47  }(gdb)